[
  {
    "id": "codtime",
    "title": "CodTime",
    "year": "2022",
    "imagePath": "codtime-splash-img.png",
    "images": [
      "codtime/projects-1.png",
      "codtime/statisticss-1.png",
      "codtime/welcome-1.png",
      "codtime-splash-img.png"
    ],
    "description": "A primeira versão do CodTime surgiu de uma necessidade pessoal. Eu precisava de um sistema fácil e simples que registrasse as horas que eu trabalhava nos projetos como freelancer. No entanto, todas as opções do mercado eram complexas e com foco empresarial. Assim, decidi criar meu próprio sistema de registro de horas. Logo depois, ele se tornou meu Projeto de Graduação (PG) na UFES. A ideia cresceu e evoluiu para um sistema de gerenciamento de horas de trabalho integrado ao GitLab. Com foco na produtividade de equipes de desenvolvedores, o sistema utiliza o SCRUM como base.",
    "activities": [
      "UI/UX",
      "Desenvolvimento sistema web",
      "Integração com GitLab"
    ],
    "tools": ["Figma", "Node", "Vue", "Vercel", "Insomnia"]
  },
  {
    "id": "erp-linhagua",
    "title": "ERP-Linhagua",
    "year": "2020",
    "imagePath": "linhagua-splash-img.png",
    "images": [
      "linhagua/dashboard.png",
      "linhagua/expenses-1.png",
      "linhagua/schedule-1.png",
      "linhagua-splash-img.png"
    ],
    "description": "O ponta de lança! Esse sistema foi o meu primeiro projeto para terceiros. Desenvolvi um ERP (Enterprise Resource Planning) que foi construído para agilizar todo o processo de produção de uma empresa de envase de água mineral, desde o agendamento até o pagamento dos clientes, abarcando todos os processos da empresa.",
    "activities": ["UI/UX", "Back-end", "Front-end"],
    "tools": ["Vue", "AdonisJS", "PostgreSQL", "Docker", "Heroku", "Vercel"]
  },
  {
    "id": "driveranalytics",
    "title": "Driver Analytics",
    "year": "2023",
    "imagePath": "da-banner-image.png",
    "images": [
      "DA/dashborad-1.png",
      "DA/events-1.png",
      "DA/map-dark-1.png",
      "DA/map-light-1.png",
      "DA/map-light-2.png"
    ],
    "description": "Lidero um dos principais projetos da Motora, onde faço parte da equipe de desenvolvimento. O portal Driver Analytics é um sistema web que lida com todo o processo de gestão da condução dos motoristas dos clientes. Eles têm acesso a todas as informações geradas pelos equipamentos IOT instalados nos veículos, que monitoram os motoristas por meio de Inteligência Artificial.",
    "activities": ["Back-end", "Front-end", "Ajustes de UI/UX"],
    "tools": ["Agular", "Leaflet", "Node", "MongoDB", "Figma"]
  },
  {
    "id": "sca-amaes",
    "title": "SCA Amaes",
    "year": "2022",
    "imagePath": "sca-amaes-splash.png",
    "images": [
      "sca-amaes/amaes-assisted-filter.png",
      "sca-amaes/amaes-assisted-form.png",
      "sca-amaes/amaes-assisted-list.png",
      "sca-amaes/amaes-logo.png",
      "sca-amaes/amaes-ptojrtc-list.png"

    ],
    "description": "Enquanto colaborava com o laboratório LabES na UFES, participei da criação do SCA AMAES, um sistema de valor inestimável. Ele visa aprimorar a gestão da AMAES, uma associação sem fins lucrativos que trabalha com pessoas autistas no Espírito Santo. Nesse contexto desafiador, o sistema desempenha um papel crucial ao otimizar a administração, permitindo que a associação concentre seus recursos no apoio direto às pessoas autistas e suas famílias.",
    "activities": ["UI/UX", "Front-end"],
    "tools": ["NextJs", "Figma", "Tailwind"]
  }
]
