[
  {
    "id": "codtime",
    "title": "CodTime",
    "year": "2022",
    "imagePath": "codtime-splash-img.png",
    "images": [
      "codtime/projects-1.png",
      "codtime/statisticss-1.png",
      "codtime/welcome-1.png",
      "codtime-splash-img.png"
    ],
    "description": "A primeira versão do CodTime surgiu de uma necessidade pessoal. Eu precisava de um sistema fácil e simples que registrasse as horas que eu trabalhava nos projetos como freelancer. No entanto, todas as opções do mercado eram complexas e com foco empresarial. Assim, decidi criar meu próprio sistema de registro de horas. Logo depois, ele se tornou meu Projeto de Graduação (PG) na UFES. A ideia cresceu e evoluiu para um sistema de gerenciamento de horas de trabalho integrado ao GitLab. Com foco na produtividade de equipes de desenvolvedores, o sistema utiliza o SCRUM como base.",
    "activities": [
      "UI/UX",
      "Desenvolvimento sistema web",
      "Integração com GitLab"
    ],
    "tools": ["Figma", "Node", "Vue", "Vercel", "Insomnia"]
  },
  {
    "id": "erp-linhagua",
    "title": "ERP-Linhagua",
    "year": "2020",
    "imagePath": "linhagua-splash-img.png",
    "images": [
      "linhagua/dashboard.png",
      "linhagua/expenses-1.png",
      "linhagua/schedule-1.png",
      "linhagua-splash-img.png"
    ],
    "description": "O ponta de lança! Esse sistema foi o meu primeiro projeto para terceiros. Desenvolvi um ERP (Enterprise Resource Planning) que foi construído para agilizar todo o processo de produção de uma empresa de envase de água mineral, desde o agendamento até o pagamento dos clientes, abarcando todos os processos da empresa.",
    "activities": ["UI/UX", "Back-end", "Front-end"],
    "tools": ["Vue", "AdonisJS", "PostgreSQL", "Docker", "Heroku", "Vercel"]
  },
  {
    "id": "driveranalytics",
    "title": "Driver Analytics",
    "year": "2023",
    "imagePath": "da-banner-image.png",
    "images": [
      "DA/dashborad-1.png",
      "DA/events-1.png",
      "DA/map-dark-1.png",
      "DA/map-light-1.png",
      "DA/map-light-2.png"
    ],
    "description": "Lidero um dos principais projetos da Motora, onde faço parte da equipe de desenvolvimento. O portal Driver Analytics é um sistema web que lida com todo o processo de gestão da condução dos motoristas dos clientes. Eles têm acesso a todas as informações geradas pelos equipamentos IOT instalados nos veículos, que monitoram os motoristas por meio de Inteligência Artificial.",
    "activities": ["Back-end", "Front-end", "Ajustes de UI/UX"],
    "tools": ["Agular", "Leaflet", "Node", "MongoDB", "Figma"]
  },
  {
    "id": "telemetry",
    "title": "Telemetry",
    "year": "2023",
    "imagePath": "telemetry-splash-img.png",
    "images": ["telemetry-splash-img.png"],
    "description": "Como o próprio nome sugere, o Telemetry é um sistema de telemetria que auxilia no desenvolvimento do eVTOL (aeronave elétrica de decolagem e pouso vertical), também conhecido como 'carro voador' (👌🏻) , um projeto em parceria da Motora com a Embraer. O Telemetry é um sistema web com o objetivo de tornar visível, em tempo real, a trajetória sugerida e efetiva do veículo, bem como outros atributos que podem impactar no voo, como obstáculos e altimetria.",
    "activities": ["UI/UX", "Back-end", "Front-end"],
    "tools": ["Figma", "Agular", "Leaflet", "C++", "Socket++"]
  }
]
